CSI API ETABS v1
cAreaObj Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cAreaObj
Public Interface cAreaObj
Dim instance As cAreaObj
public interface class cAreaObj
type cAreaObj =  interface end
The cAreaObj type exposes the following members.
Methods
Name | Description
AddByCoord
 Adds a new area object, defining points at the specified coordinates.
AddByPoint
 Adds a new area object whose defining points are specified by name.
ChangeName
Count
Delete
 Deletes area objects.
DeleteLoadTemperature
DeleteLoadUniform
 Deletes the uniform load assignments to the specified area objects for the specified load pattern.
DeleteLoadUniformToFrame
DeleteLoadWindPressure
DeleteMass
DeleteModifiers
DeleteSpring
GetAllAreas
 Retrieves select data for all area objects in the model
GetCurvedEdges
 Retrieves curve data for all edges of an area object
GetDesignOrientation
 Retrieves the design orientation of an area object.
GetDiaphragm
 Retrieves the diaphragm assignment to the specified area object
GetEdgeConstraint
GetElm
GetGroupAssign
 Retrieves the groups to which an area object is assigned.
GetGUID
GetLabelFromName
 Retrieves the label and story for a unique area object name
GetLabelNameList
 Retrieves the names and labels of all defined area objects.
GetLoadTemperature
 Retrieves the temperature load assignments to area objects.
GetLoadUniform
 Retrieves the uniform load assignments to area objects.
GetLoadUniformToFrame
 NOT APPLICABLE - Retrieves the uniform to frame load assignments to area objects.
GetLoadWindPressure
 Retrieves the wind pressure load assignments to area objects.
GetLocalAxes
GetMass
GetMaterialOverwrite
GetModifiers
GetNameFromLabel
 Retrieves the unique name of an area object, given the label and story level
GetNameList
 Retrieves the names of all defined area objects.
GetNameListOnStory
 Retrieves the names of the defined area objects on a given story.
GetOffsets3
GetOpening
 Retrieves whether the specified area object is an opening.
GetPier
 Retrieves the pier label assignments of an area object
GetPoints
 Retrieves the names of the point objects that define an area object.
GetProperty
 Retrieves the area property assigned to an area object.
GetRebarDataPier
 Retrieves rebar data for an area pier object
GetRebarDataSpandrel
 Retrieves rebar data for an area spandrel object
GetSelected
GetSelectedEdge
GetSpandrel
 Retrieves the Spandrel label assignments of an area object
GetSpringAssignment
 Retrieves the named area spring property assignment for an area object
GetTransformationMatrix
SetDiaphragm
 Assigns a diaphragm to a specified area object
SetEdgeConstraint
 Makes generated edge constraint assignments to area objects.
SetGroupAssign
SetGUID
SetLoadTemperature
SetLoadUniform
 Assigns uniform loads to area objects.
SetLoadUniformToFrame
 NOT APPLICABLE - Assigns uniform to frame load to area objects.
SetLoadWindPressure
SetLocalAxes
 Assigns a local axis angle to area objects.
SetMass
SetMaterialOverwrite
SetModifiers
SetOpening
 Designates an area object(s) as an opening.
SetPier
 Sets the pier label assignment of one or more area objects
SetProperty
 Assigns an area property to area objects.
SetSelected
SetSelectedEdge
SetSpandrel
 Sets the Spandrel label assignment of one or more area objects
SetSpringAssignment
 Assigns an existing named area spring property to area objects
Top
See Also
Reference
ETABSv1 Namespace